# 總分為 210 分
# 及格分數為 90 分

# %%
#--------------- 簡答題 -------------------
# 問題（簡答）：請查看 training1.JPG，並請說明本圖之管理意涵與折線意涵
# 15分


# %%
# 問題（簡答）：請查看 training2.png，並請說明本圖之管理意涵
# 15分


# %%
# 問題（簡答）：請問什麼是 Accuracy trap ？
# 15分


# %%
# 問題（簡答）：請說明 p-value 與信賴區間是什麼？
# 15分


# %%
# 問題（簡答加分題）：請問進行機器學習時，如何判斷 error 是從 variance 而來還是 bias 而來？
# 若是從 variance 而來，該如何解決？
# 若是從 bias 而來，該如何解決？
# 該如何解決？
# 40分



# 至此總分100


# %%
#--------------- 機器學習 實作題 -------------------
# 問題：請看 bank.pdf 檔案，並依照過往所學之機器學習知識，對 bank_train.csv 與 bank_test.csv 執行分析
# 也可以參考 pdf 裡面的 Tip1 與 Tip2
# 60分





# 至此總分170

# %%
#---------------Streamlit  實作題 -------------------
# 問題：請查看 training3.JPG 配合 diabetes_prediction_ml_app 資料夾
# 請將紅框處轉變成「箭頭」所指之處（更改功能）
# 請將藍框處轉變成「箭頭」所指之處（更改功能）
# 請將完成的檔案，上傳到 streamlit cloud(https://share.streamlit.io/)，並在此附上網址
# 請注意 streamlit cloud 的Python版本限制在 <= 3.10
# 40分



# 至此總分210
